Revit API Introduction Labs
LabUtils.Midpoint Method
 Return the midpoint between two points.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static XYZ Midpoint(
	XYZ p,
	XYZ q
)
Visual Basic (Declaration)
Public Shared Function Midpoint ( _
	p As XYZ, _
	q As XYZ _
) As XYZ
Visual C++
public:
static XYZ^ Midpoint(
	XYZ^ p,
	XYZ^ q
)
Parameters
p
Type: XYZ
q
Type: XYZ
See Also
LabUtils Class
Labs Namespace